store/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

store/src/AccumulationRegisters/Товары/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает текущие остатки номенклатуры по складам из регистра накопления Товары//
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура
//
// Возвращаемое значение:
//   Соответствие	- Остатки номенклатуры по складам
//

Функция ПолучитьОстатки(Номенклатура) Экспорт	// ПолучитьОстатки
	Запрос = Новый Запрос;
	Запрос.Текст = "	ВЫБРАТЬ
	|	Товары.Склад КАК Склад,
	|	Товары.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(, Номенклатура = &Номенклатура) КАК Товары";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Остатки = Новый	Соответствие;
	Пока Выборка.Следующий() Цикл
		Остатки.Вставить(Выборка.Склад, Выборка.Остаток);
	КонецЦикла;
	Возврат Остатки;
КонецФункции // ПолучитьОстатки

#КонецОбласти

#КонецЕсли
